app/Http/Controllers/AttendanceController.php

select `id`, `name` from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null
---
    public function index()
    {
        $list = Schedule::with(['items', 'teacher' => function ($query) {
            $query->select('id', 'name');
        }])->where('teacher_id', auth()->user()->id)->get();

select * from `schedule_items` where `schedule_items`.`id` = '108' and `schedule_items`.`deleted_at` is null limit 1
select * from `schedules` where `schedules`.`id` = 10 and `schedules`.`deleted_at` is null limit 1
select * from `attendances` where `schedule_item_id` = '108' and `attendances`.`deleted_at` is null
---
    public function show($session_id)
    {
        $session = ScheduleItem::find($session_id);
        $schedule = Schedule::with('students', 'teacher')->find($session->schedule_id);
        $students = User::find($schedule->students->pluck('student_id'));
        $attendance = Attendance::where('schedule_item_id', $session_id)->get();