app/Models/User.php

select `schedule_id` from `schedule_students` where `student_id` = 1
select * from `branches` where `branches`.`id` in (1, 3) and `branches`.`deleted_at` is null
select * from `schedules` where `schedules`.`id` in (9, 12, 13, 14, 15) and `schedules`.`deleted_at` is null
select * from `users` where `users`.`id` in (1, 6) and `users`.`deleted_at` is null
---
    public function schedules()
    {
        $ids = ScheduleStudent::where('student_id', $this->id)->pluck('schedule_id');
        $schedules = Schedule::with(['items', 'branch', 'teacher'])->find($ids);